# St7SetHRAMode

Sets the harmonic mode for harmonic response analysis.

long St7SetHRAMode(long uID, long MType)
Input Parameters
uID
Strand7 model file ID.
MType
Harmonic mode; either hmVsFrequency or hmVsTime.